const suowar = ['الفاتحة','البقرة','آل عمران','النساء','المائدة','الأنعام','الأعراف','الأنفال','التوبة','يونس','هود','يوسف','الرعد','إبراهيم','الحجر','النحل','الإسراء','الكهف','مريم','طه'
                ,'الأنبياء','الحج','المؤمنون','النور','الفرقان','الشعراء','النمل','القصص','العنكبوت','الروم','لقمان','السجدة','الأحزاب','سبأ','فاطر','يس','الصافات','ص','الزمر','غافر'
                ,'فصلت','الشورى','الزخرف','الدخان','الجاثية','الأحقاف','محمد','الفتح','الحجرات','ق','الذاريات','الطور','النجم', 'القمر','الرحمن','الواقعة','الحديد','المجادلة','الحشر','الممتحنة'
                ,'الصف','الجمعة','المنافقون','التغابن','الطلاق','التحريم','الملك','القلم','الحاقة','المعارج','نوح','الجن','المزمل','المدثر','القيامة','الإنسان','المرسلات','النبأ','النازعات',
                'عبس','التكوير','الانفطار','المطففين','الإنشقاق','البروج','طارق','الأعلى','الغاشية','الفجر','البلد','الشمس','الليل','الضحى','الشرح','التين','العلق','القدر','البينة',
                'الزلزلة','العاديات','القارعة','التكاثر','العصر','الهمزة','الفيل','قريش','الماعون','الكوثر','الكافرون','النصر','المسد','الإخلاص','الفلق','الناس'
            ]

let options = '<select id="surah" name="surah" value="">\n'
let option = ''
let value = ''
for (let i=1;i<=suowar.length;i++) {
    if (i<10){
        value = `00${i}`
    }
    else if (i<100){
        value = `0${i}`
    }
    else{value = i}
    option = `      <option value="${value}">${suowar[i-1]}</option>\n`
    options += option 
}
options += '</select>'

document.getElementById('s').innerHTML += options